; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v3 ?v10)
             (pred_1 ?v9 ?v8)
             (pred_2 ?v3 ?v8)
             (pred_11 ?v6 ?v3 )
	     (pred_7 ?v3)
             (pred_10 ?v2)
             (pred_9 ?v9)
             (pred_8 ?v8)
             (pred_12 ?v3)
             (pred_4 ?v9)
             (pred_5 ?v3)
             (pred_3 ))



(:action op_4
:parameters (?v11 ?v13 ?v12 ?v5)
:precondition (and (pred_10 ?v11) (pred_10 ?v13) (pred_9 ?v12) (pred_8 ?v5)
          (pred_6 ?v11 ?v13) (pred_1 ?v12 ?v5)
                   (pred_2 ?v13 ?v5) (pred_7 ?v11) 
                   (pred_12 ?v13) (pred_4 ?v12))
:effect (and  (pred_5 ?v13) (not (pred_12 ?v13))))


(:action op_2
:parameters (?v11 ?v4)
:precondition (and (pred_10 ?v11) (pred_10 ?v4)
               (pred_7 ?v11) (pred_6 ?v11 ?v4) (pred_5 ?v4))
:effect (and (pred_7 ?v4) (not (pred_7 ?v11))))

(:action op_5
:parameters (?v11 ?v12)
:precondition (and (pred_10 ?v11) (pred_9 ?v12) 
                  (pred_7 ?v11) (pred_11 ?v12 ?v11) (pred_3 ))
:effect (and (pred_4 ?v12)
   (not (pred_11 ?v12 ?v11)) (not (pred_3 ))))


(:action op_3
:parameters (?v11 ?v7 ?v1)
:precondition (and (pred_10 ?v11) (pred_9 ?v7) (pred_9 ?v1)
                  (pred_7 ?v11) (pred_4 ?v1) (pred_11 ?v7 ?v11))
:effect (and (pred_4 ?v7) (pred_11 ?v1 ?v11)
        (not (pred_4 ?v1)) (not (pred_11 ?v7 ?v11))))

(:action op_1
:parameters (?v11 ?v12)
:precondition (and (pred_10 ?v11) (pred_9 ?v12) 
                  (pred_7 ?v11) (pred_4 ?v12))
:effect (and (pred_3 ) (pred_11 ?v12 ?v11) (not (pred_4 ?v12)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_01 obj_03 obj_06 obj_09 obj_08 obj_05 obj_11 obj_13
    obj_12 obj_02
    obj_10 obj_07
    )

    (:init
       (pred_3)

       (pred_10 obj_04)
       (pred_10 obj_01)
       (pred_10 obj_03)
       (pred_10 obj_06)
       (pred_10 obj_09)
       (pred_10 obj_08)
       (pred_10 obj_05)
       (pred_10 obj_11)
       (pred_10 obj_13)
       (pred_8 obj_12)
       (pred_8 obj_02)
       (pred_9 obj_10)
       (pred_9 obj_07)

       (pred_6 obj_04 obj_06)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_01 obj_03)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_03 obj_08)
       (pred_6 obj_03 obj_01)
       (pred_6 obj_06 obj_05)
       (pred_6 obj_06 obj_09)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_09 obj_11)
       (pred_6 obj_09 obj_08)
       (pred_6 obj_09 obj_01)
       (pred_6 obj_09 obj_06)
       (pred_6 obj_08 obj_13)
       (pred_6 obj_08 obj_03)
       (pred_6 obj_08 obj_09)
       (pred_6 obj_05 obj_11)
       (pred_6 obj_05 obj_06)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_09)
       (pred_6 obj_11 obj_05)
       (pred_6 obj_13 obj_08)
       (pred_6 obj_13 obj_11)
       (pred_12 obj_13)
       (pred_12 obj_03)
       (pred_2  obj_13 obj_12)
       (pred_2  obj_03 obj_02)
       (pred_5 obj_04)
       (pred_5 obj_01)
       (pred_5 obj_06)
       (pred_5 obj_09)
       (pred_5 obj_08)
       (pred_5 obj_05)
       (pred_5 obj_11)

       (pred_1  obj_10 obj_12)
       (pred_1  obj_07 obj_02)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_07 obj_05)
       (pred_7 obj_09)
    )

    (:goal (and
       (pred_11 obj_07 obj_09)
    ))
(:constraints
  (always (not (pred_7 obj_06)))
)
)

; plan
1. (op_2 obj_09 obj_11)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_11)
   goals met: 0 of 1
2. (op_2 obj_11 obj_05)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_05)
   goals met: 0 of 1
3. (op_5 obj_05 obj_07)
   deleted: (pred_11 obj_07 obj_05) (pred_3)
   added: (pred_4 obj_07)
   goals met: 0 of 1
4. (op_2 obj_05 obj_11)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_11)
   goals met: 0 of 1
5. (op_2 obj_11 obj_09)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_09)
   goals met: 0 of 1
6. (op_3 obj_09 obj_10 obj_07)
   deleted: (pred_4 obj_07) (pred_11 obj_10 obj_09)
   added: (pred_4 obj_10) (pred_11 obj_07 obj_09)
   goals met: 1 of 1
